Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable Class Referencefinal
MEP Element Manager
The DuctRectangularSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
#include <MEPDuctRectangularSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable:
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< double >  | GetValue (uint32_t index) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewPreference ()
Inserts a new empty line in the table.
Result< void >  | Delete (uint32_t index)
Deletes a row from the table.
Result< uint32_t >  | SetValue (uint32_t index, double value)
Sets the value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctRectangularSegmentPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctRectangularSegmentPreferenceTable.
 Protected Member Functions
Modifier (DuctRectangularSegmentPreferenceTable &parent)
Constructs a Modifier with the given DuctRectangularSegmentPreferenceTable.
 void  | FinalizeModification () override
Finalizes the modifications.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctRectangularSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order.
Since
Archicad 28
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Member Function Documentation
◆ AddNewPreference()
 Result< uint32_t > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::AddNewPreference  |  ( |   | )
Inserts a new empty line in the table.
Returns
Returns error if there is already an unset row in the DuctRectangularSegmentPreferenceTable, otherwise returns the index of the newly inserted row. Do not forget to set a value to it afterwards, otherwise it will be automatically deleted at the end of the Modify scope.
◆ Delete()
 Result< void > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::Delete  |  ( |  uint32_t  |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctRectangularSegmentPreferenceTable > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a DuctRectangularSegmentPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctRectangularSegmentPreferenceTable.
Returns
If the uniqueId belongs to a DuctRectangularSegmentPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::GetDescription  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is not defined for the DuctRectangularSegmentPreferenceTable, otherwise returns the description of a table's row.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of the table.
◆ GetValue()
 Result< double > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::GetValue  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is not defined for the DuctRectangularSegmentPreferenceTable, otherwise returns the value of a table's row.
◆ IsEditable()
 Result< void > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::IsEditable  |  ( |   | ) |   const
Returns
Checks if the object currently is editable.
◆ Modifier()
 ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::Modifier  |  ( |  DuctRectangularSegmentPreferenceTable &  |  parent | )
protected
Constructs a Modifier with the given DuctRectangularSegmentPreferenceTable.
Parameters
parent | The given DuctRectangularSegmentPreferenceTable.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::SetDescription  |  ( |  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetValue()
 Result< uint32_t > ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable::SetValue  |  ( |  uint32_t  |  index,
|  double  |  value
)
Sets the value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range or if the new value would be a duplicate, otherwise returns the new index of the modified row.